# TagPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaCreationData..::..TagPoint Property
AreaCreationData Class See Also
---
Specify the location of the area tag.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV TagPoint { get; set; }
```

Visual Basic
---
```text
Public Property TagPoint As UV
	Get
	Set
```

Visual C++
---
```text
public:
property UV^ TagPoint {
	UV^ get ();
	void set (UV^ value);
}
```

# See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace